Tekla Open API Reference for Tekla Structures 2025
TextAlignment Enumeration
 The alignment of the text.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum TextAlignment
Public Enumeration TextAlignment
Members
Member name | Value | Description
Left | 0 |  The left aligned text.
Center | 1 |  The center aligned text.
Right | 2 |  The right aligned text.
LeaderLine | 3 |  The text is aligned to leader line direction
See Also
Reference
Tekla.Structures.Drawing Namespace